Repository: jbig3/big5
Catalog: module/Jbig3I18n/language/*.po
Languages: de_de

source: Invalid type given. String, integer or float expected
de_de: Ungültiger Typ angegeben. String, Integer oder Float erwartet

source: The input contains characters which are non alphabetic and no digits
de_de: '%value%' enthält Zeichen welche keine Buchstaben und keine Ziffern sind

source: The input is an empty string
de_de: '%value%' ist ein leerer String

source: Invalid type given. String expected
de_de: Ungültiger Typ angegeben. String erwartet

source: The input contains non alphabetic characters
de_de: '%value%' enthält Zeichen welche keine Buchstaben sind

source: The input failed checksum validation
de_de: '%value%' hat die Prüfung der Checksumme nicht bestanden

source: The input contains invalid characters
de_de: '%value%' enthält Zeichen welche nicht zugelassen sind

source: The input is not between '%min%' and '%max%', inclusively
de_de: %value%' ist nicht zwischen '%min%' und '%max%', inklusive diesen Werten

source: The input is not strictly between '%min%' and '%max%'
de_de: '%value%' ist nicht strikt zwischen '%min%' und '%max%'

source: The input is not valid
de_de: %value%' ist nicht zulässig

source: An exception has been raised within the callback
de_de: Eine Exception wurde im Callback geworfen

source: The input seems to contain an invalid checksum
de_de: '%value%' scheint eine ungültige Prüfsumme zu enthalten

source: The input must contain only digits
de_de: '%value%' darf nur Ziffern enthalten

source: The input contains an invalid amount of digits
de_de: '%value%' enthält eine ungültige Anzahl an Ziffern

source: The input is not from an allowed institute
de_de: '%value%' ist nicht von einem der erlaubten Institute

source: The input seems to be an invalid credit card number
de_de: '%value%' scheint eine ungültige Kreditkarten-Nummer zu sein

source: An exception has been raised while validating the input
de_de: Eine Exception wurde wärend der Prüfung von '%value%' geworfen

source: The form submitted did not originate from the expected site
de_de: Die Eingabeziet für das Formular ist abgalufen. Bitte rufen Sie es erneut auf.

source: Invalid type given. String, integer, array or DateTime expected
de_de: Ungültiger Typ angegeben. String, Integer, Array oder DateTime erwartet.

source: The input does not appear to be a valid date
de_de: '%value%' scheint kein gültiges Datum zu sein

source: The input does not fit the date format '%format%'
de_de: '%value%' passt nicht in das angegebene Datumsformat '%format%'

source: No record matching the input was found
de_de: Es wurde kein Eintrag gefunden der '%value%' entspricht

source: A record matching the input was found
de_de: Ein Eintrag der '%value%' entspricht wurde gefunden

source: The input is not a valid step
de_de: %value%' ist kein zulässiger Schritt

source: The input does not appear to be a valid datetime
de_de: '%value%' scheint kein gültiges Datum zu sein

source: The input is not a valid email address. Use the basic format local-part@hostname
de_de: '%value%' ist keine gültige Emailadresse im Basisformat local-part@hostname

source: '%hostname%' is not a valid hostname for the email address
de_de: '%hostname%' ist kein gültiger Hostname für die Emailadresse '%value%'

source: '%hostname%' does not appear to have any valid MX or A records for the email address
de_de: '%hostname%' scheint keinen gültigen MX Eintrag für die Emailadresse '%value%' zu haben

source: '%hostname%' is not in a routable network segment. The email address should not be resolved from public network
de_de: '%hostname%' ist in keinem routebaren Netzwerksegment. Die Emailadresse '%value%' sollte nicht vom öffentlichen Netz aus aufgelöst werden

source: '%localPart%' is not a valid local part for the email address
de_de: '%localPart%' ist kein gültiger lokaler Teil für die Emailadresse '%value%'

source: The input exceeds the allowed length
de_de: '%value%' ist länger als erlaubt

source: Invalid type given
de_de: Ungültiger Typ angegeben.

source: The input does not appear to be a float
de_de: '%value%' scheint kein gültiges Float-Format zu sein

source: The input is not greater than '%min%'
de_de: '%value%' ist nicht größer als '%min%'

source: The input is not greater or equal than '%min%'
de_de: '%value%' ist nicht größer oder gleich als '%min%'

source: The input contains non-hexadecimal characters
de_de: '%value%' enthält Zeichen welche nicht hexadezimal sind

source: The input appears to be a DNS hostname but the given punycode notation cannot be decoded
de_de: '%value%' scheint ein DNS Hostname zu sein, aber die angegebene Punycode Schreibweise konnte nicht dekodiert werden

source: The input appears to be a DNS hostname but contains a dash in an invalid position
de_de: '%value%' scheint ein DNS Hostname zu sein, enthält aber einen Bindestrich an einer ungültigen Position

source: The input does not match the expected structure for a DNS hostname
de_de: '%value%' passt nicht in die erwartete Struktur für einen DNS Hostname

source: The input appears to be a DNS hostname but cannot match against hostname schema for TLD '%tld%'
de_de: '%value%' scheint ein DNS Hostname zu sein, passt aber nicht in das Hostname Schema für die TLD '%tld%'

source: The input does not appear to be a valid local network name
de_de: '%value%' scheint kein gültiger lokaler Netzerkname zu sein

source: The input does not appear to be a valid URI hostname
de_de: '%value%' scheint kein gültiger URI Hostname zu sein

source: The input appears to be an IP address, but IP addresses are not allowed
de_de: '%value%' scheint eine IP Adresse zu sein, aber IP Adressen sind nicht erlaubt

source: The input appears to be a local network name but local network names are not allowed
de_de: '%value%' scheint ein lokaler Netzwerkname zu sein, aber lokale Netzwerknamen sind nicht erlaubt

source: The input appears to be a DNS hostname but cannot extract TLD part
de_de: '%value%' scheint ein DNS Hostname zu sein, aber der TLD Teil konnte nicht extrahiert werden

source: The input appears to be a DNS hostname but cannot match TLD against known list
de_de: '%value%' scheint ein DNS Hostname zu sein, aber die TLD wurde in der bekannten Liste nicht gefunden

source: Unknown country within the IBAN
de_de: Unbekanntes Land in der IBAN '%value%'

source: The input has a false IBAN format
de_de: '%value%' enthält ein falsches IBAN Format

source: The input has failed the IBAN check
de_de: Die IBAN Prüfung ist für '%value%' fehlgeschlagen

source: The two given tokens do not match
de_de: Die zwei angegebenen Token stimmen nicht überein

source: No token was provided to match against
de_de: Es wurde kein Token angegeben gegen den geprüft werden kann

source: The input was not found in the haystack
de_de: '%value%' wurde im Haystack nicht gefunden

source: Invalid type given. String or integer expected
de_de: Ungültiger Typ angegeben. String oder Integer erwartet

source: The input does not appear to be an integer
de_de: '%value%' scheint kein gültiges Integer-Format zu sein

source: The input does not appear to be a valid IP address
de_de: '%value%' scheint keine gültige IP-Adresse zu sein

source: The input is not a valid ISBN number
de_de: %value%' ist keine gültige ISBN Nummer

source: The input is not an instance of '%className%'
de_de: '%value%' ist keine Instanz von '%className%'

source: The input is not less than '%max%'
de_de: '%value%' ist nicht kleiner als '%max%'

source: The input is not less or equal than '%max%'
de_de: '%value%' ist nicht kleiner oder gleich als '%max%'

source: Value is required and can't be empty
de_de: Es wird ein Wert benötigt. Dieser darf nicht leer sein

source: Invalid type given. String, integer, float, boolean or array expected
de_de: Ungültiger Typ angegeben. String, Integer, Float, Boolean oder Array erwartet

source: The input does not match a phone number format
de_de: '%value%' scheint kein gültiges Telefonnummern-Format zu sein

source: The country provided is currently unsupported
de_de: Das angegebne Land wird zur Zeit nihct unterstützt.

source: Invalid type given. String expected
de_de: Ungültiger Typ angegeben. String erwartet

source: The input does not appear to be a postal code
de_de: '%value%' scheint keine gültige Postleitzahl zu sein

source: The input does not match against pattern '%pattern%'
de_de: '%value%' stimmt nihct mit mit dem Pattern '%pattern%' überein

source: Invalid value given. Scalar expected
de_de: Ungültiger Typ angegeben. Scalar erwartet

source: The input is less than %min% characters long
de_de: '%value%' ist weniger als %min% Zeichen lang

source: The input is more than %max% characters long
de_de: '%value%' ist mehr als %max% Zeichen lang

source: The input does not appear to be a valid Uri
de_de: '%value%' scheint kein gültiger Uri zu sein
